# selecting everything using * super star

SELECT *
FROM coding_problems

# selecting from cols and renaming them using 'AS'

SELECT author AS comment_author, body AS comment_body
from comments

# Filtering using WHERE CLAUSE

# for checking of equality there is no need to use ==
# as the single = is not reserved for assignment as it is in most programming languages!

SELECT name, sport
FROM athletes
WHERE sport = 'Basketball'

# Filtering using WHERE NOT CLAUSE

# for checking of equality there is no need to use ==
# as the single = is not reserved for assignment as it is in most programming languages!

SELECT name, sport
FROM athletes
WHERE sport != 'Basketball'

# SELECct WHERE COMPARISON

SELECT *
FROM basketball_boxscore
WHERE away_team_points > home_team_points

# SELECTING NULL AND NOT NULL

SELECT *
FROM comments

# for NOT NULL
WHERE author IS NOT NULL

# for NULL
WHERE author IS NULL

# DISTINCT in SELECT
# REMMEBR IS 'DISTINCT' NOT 'UNIQUE'!!! LOLOLOL

SELECT DISTINCT country
FROM cities

# SELECT LIKE
# this LIKE operator helps to filter strings based on patterns rather than exact string matching similarly to regex

# THE LIKE OPERATOR uses these two wildcard characters
# '%': Matches any sequecne of characters
# '_': Matches any character


# this returns everystring that starts with N, no minimum length
SELECT *
FROM comments
WHERE author LIKE 'N%';

vs

# this returns everystring that starts with N, but with a minimum length of at least 3 charcters in total since there are two '_'
SELECT *
FROM comments
WHERE author LIKE 'N__%';

# SELECT IN
# this fitler rows based on a list of values

SELECT c.name
from cities c

# the list of values that should be included
WHERE c.country IN ('USA', 'Mexico', 'Canada')

# SELECT BETWEEN FOR A RANGE OF VALUES

# 1 and 3 inclusive, or 1 <= id <= 3 (VALUES)
WHERE id BETWEEN 1 AND 3;

# between '2024-01-01' and '2024-01-31' inclusive. (DATES)
WHERE posted_at BETWEEN '2024-01-01' AND '2024-01-31';

# final example on how to use between
SELECT DISTINCT country
FROM cities
WHERE population BETWEEN 1000000 AND 10000000

# syntax is used at WHEN
# WHEN var_name BETWEEN value_condition_1 AND value_condition_2

# if the string is
Cat
Dog
Eat --here
Food
Google
Neat
Need --here
Neet
Zebra

# column is between 'Eat' and 'Neet' inclusive
WHERE author BETWEEN 'Eat' AND 'Neet';

# this will give all the rows in between
# if there are not inside or the range is weird then it will return 0

Eat --here
Food
Google
Neat
Need --here

# using LOGICAL OPERATORS instead of BETWEEN


# NOT LIKE or AND NOT can be used
SELECT name
FROM cities
WHERE (population < 1000000 OR population > 10000000) AND (name NOT LIKE 'C%');

SELECT name
FROM cities
WHERE (population < 1000000 OR population > 10000000) AND NOT (name LIKE 'C%');

# SELECT ORDER BY ASC DESC
# THE FUNCTION IS CALLED ORDER BY not SORT LOL
# then can use DESC or ASC

SELECT author, body, created_at
FROM comments
ORDER BY created_at DESC

# SELECT LIMIT, its like selecting the first top N rows

# syntax is just LIMIT N where n refers to how many rows will be returned
# if limit is more, it will just display what is has

SELECT *
FROM flights
WHERE origin='London' AND destination='Paris'
ORDER BY price asc
LIMIT 2